### Pandas - Dataframe And Series

Pandas is powerful data maipulation library in python. widely used for data analysis and data cleaning . it provides two primary data structures - dataframe and series.
A Series is a one dimensional array like object, while DataFrame is a two dimensional, size-mutable and potentially heterogenous tabular data structure with labelled axes(rows and columns)

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\hp\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (2.2.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\hp\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd

In [4]:
import pandas as pd
data = [1,2,3,4,5]
series = pd.Series(data)
print("series\n", series)

series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
#crreating a series from a dictonary

dictpd = {"a":1,"b":2,"c":3}
series_dict = pd.Series(dictpd)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [12]:
#DAtaframe

data = {
    "Name :": ['Pranav','Shrushti','Medini'],
    "Age :": [19,21,22],
    "City :": ["Bangalore","Airoli","Gothivali"]
}

df = pd.DataFrame(data)
print(df)
print(type(df))

     Name :  Age :     City :
0    Pranav     19  Bangalore
1  Shrushti     21     Airoli
2    Medini     22  Gothivali
<class 'pandas.core.frame.DataFrame'>

In [10]:
df = pd.read_csv('sales_data.csv')
(df.head(5))

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2023,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,930995,ANZSIC06 divisions A-S (excluding classes K633...
1,2023,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,821630,ANZSIC06 divisions A-S (excluding classes K633...
2,2023,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,84354,ANZSIC06 divisions A-S (excluding classes K633...
3,2023,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,25010,ANZSIC06 divisions A-S (excluding classes K633...
4,2023,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,832964,ANZSIC06 divisions A-S (excluding classes K633...

In [13]:
# accessing data from dataframe
df

     Name :  Age :     City :
0    Pranav     19  Bangalore
1  Shrushti     21     Airoli
2    Medini     22  Gothivali

In [21]:
(df.loc[1][2])

C:\Users\hp\AppData\Local\Temp\ipykernel_18036\2552661544.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  (df.loc[1][2])

'Airoli'

In [24]:
df.at[1,'Age :']

21

In [25]:
df['Occupation']=['Student','Working','Working']
df

     Name :  Age :     City : Occupation
0    Pranav     19  Bangalore    Student
1  Shrushti     21     Airoli    Working
2    Medini     22  Gothivali    Working

In [26]:
 df.describe()

           Age :
count   3.000000
mean   20.666667
std     1.527525
min    19.000000
25%    20.000000
50%    21.000000
75%    21.500000
max    22.000000